Revit 2026 API

# FamilyInstanceHostFace Property

---

Property to get the reference to the host face of family instance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Reference HostFace { get; }
```
```vb
Public ReadOnly Property HostFace As Reference
	Get
```
```cpp
public:
property Reference^ HostFace {
	Reference^ get ();
}
```
```fsharp
member HostFace : Reference with get
```

#### Property Value

ReferenceIf the instance is placed on a work plane, this property will return the reference to the geometry face underlying the work plane. If the work plane is not referencing other geometry, this property will return . If the instance is not hosted on a face or work plane, this property will return .

#### Reference

FamilyInstance Class

Autodesk.Revit.DB Namespace